Revit 2027 API
FabricationPart.ProductSizeDescription Property
 The product size description of the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ProductSizeDescription { get; }
Public ReadOnly Property ProductSizeDescription As String
	Get
public:
property String^ ProductSizeDescription {
	String^ get ();
}
member ProductSizeDescription : string with get
Property Value
String
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace